#+TITLE: Google Drive Guide
#+STARTUP: indent
#+STARTUP: content
* TASK LOG
  :LOGBOOK:
  CLOCK: [2018-05-10 Thu 18:21]--[2018-05-10 Thu 18:28] =>  0:07
  CLOCK: [2018-05-10 Thu 17:09]--[2018-05-10 Thu 17:43] =>  0:34
  CLOCK: [2018-05-10 Thu 16:47]--[2018-05-10 Thu 17:07] =>  0:20
  CLOCK: [2018-05-10 Thu 13:17]--[2018-05-10 Thu 13:48] =>  0:31
  CLOCK: [2018-05-10 Thu 11:25]--[2018-05-10 Thu 11:31] =>  0:06
  CLOCK: [2018-05-10 Thu 10:51]--[2018-05-10 Thu 11:23] =>  0:32
  :END:
  
** DONE Define specific goal
** DONE Outline
** TODO Write Draft                                            :In:Progress:
** TODO Resolve comments
** TODO Add sections to goal summary
** TODO Convert into a presentation                    
* Learning Goal 
This will teach  and the basics of Google Drive's file management.

Concepts covered will include the:
+ Difference bewteen the basics and the fundamentals
+ Fundamentals of navigating a computer's file system

* Basics vs Fundamentals: Defining The Terms
The basics are swinging a bat at a ball.

The fundamentals are the
+ Stance
+ Hip engagement
+ Coordination and
+ Timing
needed to hit a ball really far.

If you 'learn the basics' of Google Drive as
+ Word processing
+ Ledger based accounting
+ Making slides
you won't understand the fundamentals.

# Add image of owl here

In summary:

The *basics* are what you need to know to /start/ doing a given task.

The *fundamentals* are all the things you /practice/.
* History Lesson: How To View Files Like Dr DOS
Before discussing a cloud based file management tool like Google Drive, you need to understand how computers manage files.

To uncover this, let's talk about one of the first commercially successful operating systems was DOS (the Disk Operating System).

When you think of DOS you think of a terminal buffer (window) like this:

# Find an image of G RR M writing on a DOS prompt
/Fun Fact: George RR Martin wrote Game Of Thrones using WordStar (a Word predecessor) on an DOS terminal./

Navigation in DOS was like walking through a library.

There are books (files).  The books are on shelves (in folders).  The shelves have numbers (names).

You can move from floor to floor (~.~ and ~..~).  You can move from shelf to shelf (~cd to/some/path~).

That is how a terminal buffer moves around files.

# Record a video of navigating files

* Google Drive
** Wat?
Cloud based file management tool.
# image describing what the cloud is.
Drive contains all the files from an Google Drive connect app.

Google Cloud has 5 basic apps: Docs, Sheets, Presentations, Draw, Scripts.

Others from include Google Photos, Youtube, Google Analytics, and Google Adwords.

Drive also contains 3rd party apps like ShiftEdit, AirTable and Coda.io.
*** URL Structure
# Look at drive description and URL for a file and a document.

** Getting Help In Drive
Too many 'this is what you need to know talks' skip the practice of *Introducing The Docs* and that limits the usefulness of any /'introductory'/ presentation.
As I walk you through this I am always going to start with where to get help, the help keyboard commands, and navigating the help documents.

It may seem boring.  But, Drive is over a decade old and has undergone *MANY* revisions.  Finding help the right way is critical to using this powerful tool.

+ URL for drive
+ Google Developers url
+ Keyboard commands for shortcuts and help

** Drive Apps
*** Docs
*** Sheets
*** Presentations
*** Draw
*** Scripts
*** Add-ons & Add-on market
** 3rd Party Apps

